{
  "_name_or_path": "prajjwal1/bert-tiny",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 128,
  "id2label": {
    "0": "B-ACCOUNTNAME",
    "1": "B-ACCOUNTNUMBER",
    "2": "B-AMOUNT",
    "3": "B-BIC",
    "4": "B-BITCOINADDRESS",
    "5": "B-BUILDINGNUMBER",
    "6": "B-CITY",
    "7": "B-COUNTY",
    "8": "B-CREDITCARDCVV",
    "9": "B-CREDITCARDISSUER",
    "10": "B-CREDITCARDNUMBER",
    "11": "B-CURRENCY",
    "12": "B-CURRENCYCODE",
    "13": "B-CURRENCYNAME",
    "14": "B-CURRENCYSYMBOL",
    "15": "B-DISPLAYNAME",
    "16": "B-EMAIL",
    "17": "B-ETHEREUMADDRESS",
    "18": "B-FIRSTNAME",
    "19": "B-FULLNAME",
    "20": "B-GENDER",
    "21": "B-IBAN",
    "22": "B-IP",
    "23": "B-IPV4",
    "24": "B-IPV6",
    "25": "B-JOBAREA",
    "26": "B-JOBDESCRIPTOR",
    "27": "B-JOBTITLE",
    "28": "B-JOBTYPE",
    "29": "B-LASTNAME",
    "30": "B-LITECOINADDRESS",
    "31": "B-MAC",
    "32": "B-MASKEDNUMBER",
    "33": "B-NAME",
    "34": "B-NEARBYGPSCOORDINATE",
    "35": "B-NUMBER",
    "36": "B-ORDINALDIRECTION",
    "37": "B-PASSWORD",
    "38": "B-PIN",
    "39": "B-SECONDARYADDRESS",
    "40": "B-SEX",
    "41": "B-SEXTYPE",
    "42": "B-STATE",
    "43": "B-STREET",
    "44": "B-STREETADDRESS",
    "45": "B-URL",
    "46": "B-USERAGENT",
    "47": "B-USERNAME",
    "48": "B-ZIPCODE",
    "49": "I-ACCOUNTNAME",
    "50": "I-ACCOUNTNUMBER",
    "51": "I-AMOUNT",
    "52": "I-BIC",
    "53": "I-BITCOINADDRESS",
    "54": "I-BUILDINGNUMBER",
    "55": "I-CITY",
    "56": "I-CREDITCARDCVV",
    "57": "I-CREDITCARDISSUER",
    "58": "I-CREDITCARDNUMBER",
    "59": "I-CURRENCY",
    "60": "I-CURRENCYCODE",
    "61": "I-CURRENCYNAME",
    "62": "I-DISPLAYNAME",
    "63": "I-EMAIL",
    "64": "I-ETHEREUMADDRESS",
    "65": "I-FIRSTNAME",
    "66": "I-FULLNAME",
    "67": "I-GENDER",
    "68": "I-IBAN",
    "69": "I-IP",
    "70": "I-IPV4",
    "71": "I-IPV6",
    "72": "I-JOBAREA",
    "73": "I-JOBTITLE",
    "74": "I-JOBTYPE",
    "75": "I-LASTNAME",
    "76": "I-LITECOINADDRESS",
    "77": "I-MAC",
    "78": "I-MASKEDNUMBER",
    "79": "I-NAME",
    "80": "I-NEARBYGPSCOORDINATE",
    "81": "I-NUMBER",
    "82": "I-PASSWORD",
    "83": "I-PIN",
    "84": "I-SECONDARYADDRESS",
    "85": "I-STATE",
    "86": "I-STREET",
    "87": "I-STREETADDRESS",
    "88": "I-URL",
    "89": "I-USERAGENT",
    "90": "I-USERNAME",
    "91": "I-ZIPCODE",
    "92": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "label2id": {
    "B-ACCOUNTNAME": 0,
    "B-ACCOUNTNUMBER": 1,
    "B-AMOUNT": 2,
    "B-BIC": 3,
    "B-BITCOINADDRESS": 4,
    "B-BUILDINGNUMBER": 5,
    "B-CITY": 6,
    "B-COUNTY": 7,
    "B-CREDITCARDCVV": 8,
    "B-CREDITCARDISSUER": 9,
    "B-CREDITCARDNUMBER": 10,
    "B-CURRENCY": 11,
    "B-CURRENCYCODE": 12,
    "B-CURRENCYNAME": 13,
    "B-CURRENCYSYMBOL": 14,
    "B-DISPLAYNAME": 15,
    "B-EMAIL": 16,
    "B-ETHEREUMADDRESS": 17,
    "B-FIRSTNAME": 18,
    "B-FULLNAME": 19,
    "B-GENDER": 20,
    "B-IBAN": 21,
    "B-IP": 22,
    "B-IPV4": 23,
    "B-IPV6": 24,
    "B-JOBAREA": 25,
    "B-JOBDESCRIPTOR": 26,
    "B-JOBTITLE": 27,
    "B-JOBTYPE": 28,
    "B-LASTNAME": 29,
    "B-LITECOINADDRESS": 30,
    "B-MAC": 31,
    "B-MASKEDNUMBER": 32,
    "B-NAME": 33,
    "B-NEARBYGPSCOORDINATE": 34,
    "B-NUMBER": 35,
    "B-ORDINALDIRECTION": 36,
    "B-PASSWORD": 37,
    "B-PIN": 38,
    "B-SECONDARYADDRESS": 39,
    "B-SEX": 40,
    "B-SEXTYPE": 41,
    "B-STATE": 42,
    "B-STREET": 43,
    "B-STREETADDRESS": 44,
    "B-URL": 45,
    "B-USERAGENT": 46,
    "B-USERNAME": 47,
    "B-ZIPCODE": 48,
    "I-ACCOUNTNAME": 49,
    "I-ACCOUNTNUMBER": 50,
    "I-AMOUNT": 51,
    "I-BIC": 52,
    "I-BITCOINADDRESS": 53,
    "I-BUILDINGNUMBER": 54,
    "I-CITY": 55,
    "I-CREDITCARDCVV": 56,
    "I-CREDITCARDISSUER": 57,
    "I-CREDITCARDNUMBER": 58,
    "I-CURRENCY": 59,
    "I-CURRENCYCODE": 60,
    "I-CURRENCYNAME": 61,
    "I-DISPLAYNAME": 62,
    "I-EMAIL": 63,
    "I-ETHEREUMADDRESS": 64,
    "I-FIRSTNAME": 65,
    "I-FULLNAME": 66,
    "I-GENDER": 67,
    "I-IBAN": 68,
    "I-IP": 69,
    "I-IPV4": 70,
    "I-IPV6": 71,
    "I-JOBAREA": 72,
    "I-JOBTITLE": 73,
    "I-JOBTYPE": 74,
    "I-LASTNAME": 75,
    "I-LITECOINADDRESS": 76,
    "I-MAC": 77,
    "I-MASKEDNUMBER": 78,
    "I-NAME": 79,
    "I-NEARBYGPSCOORDINATE": 80,
    "I-NUMBER": 81,
    "I-PASSWORD": 82,
    "I-PIN": 83,
    "I-SECONDARYADDRESS": 84,
    "I-STATE": 85,
    "I-STREET": 86,
    "I-STREETADDRESS": 87,
    "I-URL": 88,
    "I-USERAGENT": 89,
    "I-USERNAME": 90,
    "I-ZIPCODE": 91,
    "O": 92
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 2,
  "num_hidden_layers": 2,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.38.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
